In [17]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt

In [3]:
data = pd.read_csv("log_week_2_end.csv")
data.head()

         rn  loguser            query                duration
0  16493642  etl_528  from tbl_111329    duration: 240.851 ms
1  12761109  etl_528  from tbl_127353   duration: 2165.935 ms
2  28294808  etl_528  from tbl_128986  duration: 17661.026 ms
3  12703938  etl_528  from tbl_155188   duration: 1047.568 ms
4   5906380  etl_528   from tbl_48128    duration: 171.001 ms

In [4]:
data.drop(columns=["rn"], inplace=True)
data.head()

   loguser            query                duration
0  etl_528  from tbl_111329    duration: 240.851 ms
1  etl_528  from tbl_127353   duration: 2165.935 ms
2  etl_528  from tbl_128986  duration: 17661.026 ms
3  etl_528  from tbl_155188   duration: 1047.568 ms
4  etl_528   from tbl_48128    duration: 171.001 ms

In [7]:
data = data.dropna()

In [8]:
data.drop(columns=["loguser"], inplace=True)

/var/folders/y0/tdgd99f56qs2_clb5q282g7w0000gn/T/ipykernel_34161/222391775.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.drop(columns=["loguser"], inplace=True)

In [9]:
data.head()

             query                duration
0  from tbl_111329    duration: 240.851 ms
1  from tbl_127353   duration: 2165.935 ms
2  from tbl_128986  duration: 17661.026 ms
3  from tbl_155188   duration: 1047.568 ms
4   from tbl_48128    duration: 171.001 ms

In [11]:
data.duration = data.duration.apply(lambda x: x.split(" ")[1])
data.head()

/var/folders/y0/tdgd99f56qs2_clb5q282g7w0000gn/T/ipykernel_34161/616456504.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.duration = data.duration.apply(lambda x: x.split(" ")[1])

             query   duration
0  from tbl_111329    240.851
1  from tbl_127353   2165.935
2  from tbl_128986  17661.026
3  from tbl_155188   1047.568
4   from tbl_48128    171.001

In [12]:
data.duration = data.duration.astype(np.float64)

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 557929 entries, 0 to 630077
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   query     557929 non-null  object
 1   duration  557929 non-null  float64
dtypes: float64(1), object(1)
memory usage: 12.8+ MB

In [14]:
def find_table(x):
    x = re.split(",| ", x)
    arr = list()
    for i in x:
        if i.startswith("tbl"):
            arr.append(i)
    return arr

In [15]:
def type_query(x):
    x = x.split(",")
    arr = list()
    for i in x:
        ret = i.split(" ")[0]
        if ret.lower() == "into":
            arr.append(0)
        elif ret.lower() == "join":
            arr.append(1)
        else:
            arr.append(2)
    return arr

In [18]:
data["table"] = data["query"].apply(find_table)
data["type_query"] = data["query"].apply(type_query)
data.head()

             query   duration         table type_query
0  from tbl_111329    240.851  [tbl_111329]        [2]
1  from tbl_127353   2165.935  [tbl_127353]        [2]
2  from tbl_128986  17661.026  [tbl_128986]        [2]
3  from tbl_155188   1047.568  [tbl_155188]        [2]
4   from tbl_48128    171.001   [tbl_48128]        [2]

In [20]:
data["len_query"] = data["query"].apply(lambda x: len(x))
data.head()

             query   duration         table type_query  len_query
0  from tbl_111329    240.851  [tbl_111329]        [2]         15
1  from tbl_127353   2165.935  [tbl_127353]        [2]         15
2  from tbl_128986  17661.026  [tbl_128986]        [2]         15
3  from tbl_155188   1047.568  [tbl_155188]        [2]         15
4   from tbl_48128    171.001   [tbl_48128]        [2]         14

In [24]:
data.to_csv("duration_data.csv")